gdgly/NUC97X_JS/STM32F4xx/DL698/new_DL698_ConnectAppOI.c
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//158
	DataType_structure,2,
	DataType_OI,0x20,0x08,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//159
	DataType_structure,2,
	DataType_OI,0x20,0x09,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//160
	DataType_structure,2,
	DataType_OI,0x20,0x0A,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//161
	DataType_structure,2,
	DataType_OI,0x20,0x0B,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//162
	DataType_structure,2,
	DataType_OI,0x20,0x0C,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//163
	DataType_structure,2,
	DataType_OI,0x20,0x0D,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	5,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第3个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第4个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	5,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第5个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	6,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//164
	DataType_structure,2,
	DataType_OI,0x20,0x0E,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	5,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第3个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第4个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	5,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第5个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	6,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//165
	DataType_structure,2,
	DataType_OI,0x20,0x0F,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//166
	DataType_structure,2,
	DataType_OI,0x20,0x10,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//167
	DataType_structure,2,
	DataType_OI,0x20,0x11,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//168
	DataType_structure,2,
	DataType_OI,0x20,0x12,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//169
	DataType_structure,2,
	DataType_OI,0x20,0x13,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//170
	DataType_structure,2,
	DataType_OI,0x20,0x14,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//171
	DataType_structure,2,
	DataType_OI,0x20,0x15,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//172
	DataType_structure,2,
	DataType_OI,0x20,0x16,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//173
	DataType_structure,2,
	DataType_OI,0x20,0x17,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//174
	DataType_structure,2,
	DataType_OI,0x20,0x18,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//175
	DataType_structure,2,
	DataType_OI,0x20,0x19,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//176
	DataType_structure,2,
	DataType_OI,0x20,0x1A,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//177
	DataType_structure,2,
	DataType_OI,0x20,0x1B,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//178
	DataType_structure,2,
	DataType_OI,0x20,0x1C,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//179
	DataType_structure,2,
	DataType_OI,0x20,0x1D,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//180
	DataType_structure,2,
	DataType_OI,0x20,0x1E,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	1,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//181
	DataType_structure,2,
	DataType_OI,0x20,0x20,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	1,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//182
	DataType_structure,2,
	DataType_OI,0x20,0x21,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	1,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//183
	DataType_structure,2,
	DataType_OI,0x20,0x22,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	1,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//184
	DataType_structure,2,
	DataType_OI,0x20,0x23,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	1,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//185
	DataType_structure,2,
	DataType_OI,0x20,0x24,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	1,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//186
	DataType_structure,2,
	DataType_OI,0x20,0x25,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	1,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//187
	DataType_structure,2,
	DataType_OI,0x20,0x26,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//188
	DataType_structure,2,
	DataType_OI,0x20,0x27,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//189
	DataType_structure,2,
	DataType_OI,0x20,0x28,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//190
	DataType_structure,2,
	DataType_OI,0x20,0x29,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//191
	DataType_structure,2,
	DataType_OI,0x20,0x2A,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	1,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//192
	DataType_structure,2,
	DataType_OI,0x20,0x2C,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	1,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//193
	DataType_structure,2,
	DataType_OI,0x20,0x2D,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//194
	DataType_structure,2,
	DataType_OI,0x20,0x2E,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//195
	DataType_structure,2,
	DataType_OI,0x20,0x31,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//196
	DataType_structure,2,
	DataType_OI,0x20,0x32,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//197
	DataType_structure,2,
	DataType_OI,0x20,0x40,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//198
	DataType_structure,2,
	DataType_OI,0x20,0x41,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//199
	DataType_structure,2,
	DataType_OI,0x21,0x00,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,
//200
	DataType_structure,2,
	DataType_OI,0x21,0x01,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,
//201
	DataType_structure,2,
	DataType_OI,0x21,0x02,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,
//202
	DataType_structure,2,
	DataType_OI,0x21,0x03,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,
//203
	DataType_structure,2,
	DataType_OI,0x21,0x04,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,
//204
	DataType_structure,2,
	DataType_OI,0x21,0x10,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,
//205
	DataType_structure,2,
	DataType_OI,0x21,0x11,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,
//206
	DataType_structure,2,
	DataType_OI,0x21,0x12,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,
//207
	DataType_structure,2,
	DataType_OI,0x21,0x13,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
