gdgly/NUC97X_JS/STM32F4xx/DL698/new_DL698_ConnectAppOI.c
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	3,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
	//第3个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	5,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
//229
	DataType_structure,2,
	DataType_OI,0x23,0x08,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	17,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第3个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第4个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	5,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第5个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	6,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第6个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	7,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第7个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	8,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第8个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	9,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第9个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	10,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第10个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	11,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第11个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	12,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第12个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	13,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第13个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	14,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第14个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	15,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第15个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	16,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第16个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	17,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第17个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	18,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写

	//方法访问权限  array 一个方法访问权限
	DataType_array,
	3,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
	//第3个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	5,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
//230
	DataType_structure,2,
	DataType_OI,0x24,0x01,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	18,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第3个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第4个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	5,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第5个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	6,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第6个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	7,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第7个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	8,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第8个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	9,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第9个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	10,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第10个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	11,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第11个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	12,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第12个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	13,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第13个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	14,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第14个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	15,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第15个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	16,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第16个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	17,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第17个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	18,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第18个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	19,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写

	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
//231
	DataType_structure,2,
	DataType_OI,0x24,0x02,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	18,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第3个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第4个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	5,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第5个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	6,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第6个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	7,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第7个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	8,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第8个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	9,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第9个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	10,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第10个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	11,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第11个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	12,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第12个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	13,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第13个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	14,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第14个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	15,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第15个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	16,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第16个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	17,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第17个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	18,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第18个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	19,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写

	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
//232
	DataType_structure,2,
	DataType_OI,0x24,0x03,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	18,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第3个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第4个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	5,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第5个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	6,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第6个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	7,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第7个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	8,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第8个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	9,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第9个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	10,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第10个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	11,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第11个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	12,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第12个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	13,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第13个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	14,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第14个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	15,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第15个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	16,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第16个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	17,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第17个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	18,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第18个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	19,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写

	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
//233
	DataType_structure,2,
	DataType_OI,0x24,0x04,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	18,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第3个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第4个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	5,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第5个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	6,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第6个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	7,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第7个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	8,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第8个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	9,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第9个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	10,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第10个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	11,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第11个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	12,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第12个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	13,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第13个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	14,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第14个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	15,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第15个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	16,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第16个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	17,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第17个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	18,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第18个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	19,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写

	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
//234
	DataType_structure,2,
	DataType_OI,0x24,0x05,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	18,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第3个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第4个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	5,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第5个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	6,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第6个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	7,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第7个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	8,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第8个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	9,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第9个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	10,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第10个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	11,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第11个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	12,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第12个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	13,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第13个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	14,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第14个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	15,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第15个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	16,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第16个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	17,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第17个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	18,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第18个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	19,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写

	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
//235
	DataType_structure,2,
	DataType_OI,0x24,0x06,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	18,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第3个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第4个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	5,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第5个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	6,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第6个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	7,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第7个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	8,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第8个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	9,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第9个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	10,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第10个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	11,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第11个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	12,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第12个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	13,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第13个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	14,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第14个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	15,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第15个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	16,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第16个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	17,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第17个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	18,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第18个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	19,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写

	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
//236
	DataType_structure,2,
	DataType_OI,0x24,0x07,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	18,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第3个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第4个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	5,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第5个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	6,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第6个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	7,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第7个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	8,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第8个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	9,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第9个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	10,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第10个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	11,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第11个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	12,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第12个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	13,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第13个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	14,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第14个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	15,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第15个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	16,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第16个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	17,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第17个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	18,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第18个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	19,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写

	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
//237
	DataType_structure,2,
	DataType_OI,0x24,0x08,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	18,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第3个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第4个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	5,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第5个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	6,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第6个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	7,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第7个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	8,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第8个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	9,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第9个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	10,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第10个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	11,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第11个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	12,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第12个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	13,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第13个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	14,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第14个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	15,//属性ID
	DataType_enum,
	3,//0=不可访问,1=只读,2=只写,3=可读写
	//第15个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	16,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第16个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	17,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第17个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	18,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第18个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	19,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写

	//方法访问权限  array 一个方法访问权限
	DataType_array,
	2,//n方法访问权限
	//第1个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
	//第2个方法访问权限
	DataType_structure,2,
	DataType_unsigned,
	4,//方法ID
	DataType_bool,
	1,//方法访问权限   bool
//238
	DataType_structure,2,
	DataType_OI,0x25,0x00,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//239
	DataType_structure,2,
	DataType_OI,0x25,0x01,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//240
	DataType_structure,2,
	DataType_OI,0x25,0x02,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//241
	DataType_structure,2,
	DataType_OI,0x25,0x03,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
