gdgly/NUC97X_JS/STM32F4xx/DL698/new_DL698_ConnectAppOI.c
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//242
	DataType_structure,2,
	DataType_OI,0x25,0x04,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//243
	DataType_structure,2,
	DataType_OI,0x25,0x05,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//244
	DataType_structure,2,
	DataType_OI,0x25,0x06,//对象标识  OI
	DataType_structure,2,//访问权限
	//属性访问权限  array 一个属性访问权限
	DataType_array,
	2,//n个属性访问权限
	//第1个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	2,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	//第2个属性访问权限
	DataType_structure,2,
	DataType_unsigned,
	3,//属性ID
	DataType_enum,
	1,//0=不可访问,1=只读,2=只写,3=可读写
	
	//方法访问权限  array 一个方法访问权限
	DataType_array,
	0,//n方法访问权限
	//方法ID
	//方法访问权限   bool
//245





#define NUM_LIST_max     244//NUM_LIST_0012
};


//应用语境信息∷=structure
//{
//协议版本信息        long-unsigned，
//最大接收APDU尺寸   long-unsigned，
//最大发送APDU尺寸   long-unsigned，
//最大可处理APDU尺寸 long-unsigned，
//协议一致性块        bit-string(64)，
//功能一致性块        bit-string(128)，
//静态超时时间       double-long-unsigned
//}
const u8 UART_SIZE_LIST[]=
{
	DataType_structure,7,
//协议版本信息        long-unsigned，
	DataType_long_unsigned,
	SVER>>8,SVER&0xff,
//最大接收APDU尺寸   long-unsigned，
	DataType_long_unsigned,
	LENmax_APDU>>8,LENmax_APDU&0xff,
//最大发送APDU尺寸   long-unsigned，
	DataType_long_unsigned,
	2048>>8,2048&0xff,
//最大可处理APDU尺寸 long-unsigned，
	DataType_long_unsigned,
	LENmax_APDU>>8,LENmax_APDU&0xff,
//协议一致性块        bit-string(64)，
	DataType_bit_string,64,
	(Protocol0<<7)+(Protocol1<<6)+(Protocol2<<5)+(Protocol3<<4)+(Protocol4<<3)+(Protocol5<<2)+(Protocol6<<1)+(Protocol7<<0),
	(Protocol8<<7)+(Protocol9<<6)+(Protocol10<<5)+(Protocol11<<4)+(Protocol12<<3)+(Protocol13<<2)+(Protocol14<<1)+(Protocol15<<0),
	(Protocol16<<7)+(Protocol17<<6)+(Protocol18<<5)+(Protocol19<<4)+(Protocol20<<3)+(Protocol21<<2)+(Protocol22<<1)+(Protocol23<<0),
	(Protocol24<<7)+(Protocol25<<6)+(Protocol26<<5)+(Protocol27<<4)+(Protocol28<<3)+(Protocol29<<2)+(Protocol30<<1)+(Protocol31<<0),
	(Protocol32<<7)+(Protocol33<<6)+(Protocol34<<5)+(Protocol35<<4)+(Protocol36<<3)+(Protocol37<<2)+(Protocol38<<1)+(Protocol39<<0),
	0,
	0,
	0,
//功能一致性块        bit-string(128)，
	DataType_bit_string,0x82,0,128,
	(Function0<<7)+(Function1<<6)+(Function2<<5)+(Function3<<4)+(Function4<<3)+(Function5<<2)+(Function6<<1)+(Function7<<0),
	(Function8<<7)+(Function9<<6)+(Function10<<5)+(Function11<<4)+(Function12<<3)+(Function13<<2)+(Function14<<1)+(Function15<<0),
	(Function16<<7)+(Function17<<6)+(Function18<<5)+(Function19<<4)+(Function20<<3)+(Function21<<2)+(Function22<<1)+(Function23<<0),
	(Function24<<7)+(Function25<<6)+(Function26<<5)+(Function27<<4)+(Function28<<3)+(Function29<<2)+(Function30<<1)+(Function31<<0),
	(Function32<<7)+(Function33<<6)+(Function34<<5)+(Function35<<4)+(Function36<<3)+(Function37<<2)+(Function38<<1)+(Function39<<0),
	0,
	0,
	0,
	
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
//静态超时时间       double-long-unsigned
	DataType_double_long_unsigned,
	0,0,2000>>8,2000&0xff,
};



u32 GET_OAD_ConnectApp(u32 PORTn,u32 OAD,u8* p8tx,u32 LENmax_TxSPACE)//读应用连接可访问对象列表;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 x;
	u32 n;
	u32 Array;
	u32 Len;
	u32 NUMmax;
	u8 *p8;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	UARTCtrl->DAR=0;//数据访问结果;成功
	switch(OAD)
	{
		case 0x44000200://应用连接:对象列表∷=array 一个可访问对象
			p8tx[0]=DataType_array;
			Len=2;
			Array=0;//填入数组数
			NUMmax=NUM_LIST_max;
			n=UARTCtrl->NEXTOADSubNum;//DL698分帧传输OAD内子计数
			p8=(u8*)ConnectAppOI_LIST;
			for(i=0;i<n;i++)
			{
				p8+=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据)
			}
			while(1)
			{
				if(n>=NUMmax)
				{
					break;
				}
				x=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据)
				if(x>LENmax_TxSPACE)
				{//发送缓冲不够,分帧
					if(UARTCtrl->NEXT==0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					{
						UARTCtrl->NEXT=1;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					}
					else
					{
						UARTCtrl->NEXT=2;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					}
					UARTCtrl->NEXTOADSubNum=n;//DL698分帧传输OAD内子计数
					p8tx[1]=Array;//填入配置组数
					return Len;
				}
				MR((u32)p8tx+Len,(u32)p8,x);
				p8+=x;
				Len+=x;
				LENmax_TxSPACE-=x;
				Array++;//填入配置组数
				n++;
			}
			if(UARTCtrl->NEXT!=0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
			{
				UARTCtrl->NEXT=3;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
			}
			UARTCtrl->NEXTOADSubNum=n;//DL698分帧传输OAD内子计数
			p8tx[1]=Array;//填入配置组数
			return Len;
		case 0x44000300://应用连接:应用语境信息
			Len=sizeof(UART_SIZE_LIST);
			if(LENmax_TxSPACE<Len)
			{
				GET_Request_Frame(PORTn);//分帧标志
				return 0;
			}
			MR((u32)p8tx,(u32)UART_SIZE_LIST,Len);
			return Len;
		case 0x44000400://应用连接:当前连接的客户机地址
			//当前连接的客户机地址∷=unsigned
			if(LENmax_TxSPACE<2)
			{
				GET_Request_Frame(PORTn);//分帧标志
				return 0;
			}
			if(UARTCtrl->OAD_44000400[0]==DataType_unsigned)
			{
				p8tx[0]=DataType_unsigned;
				p8tx[1]=UARTCtrl->OAD_44000400[1];
				return 2;
			}
			p8tx[0]=0;
			return 1;
		case 0x44000500://应用连接:连接认证机制
			//连接认证机制∷=enum
			//{
			//  公共连接   (0)，
			//  普通密码   (1)，
			//  对称加密   (2)，
			//  数字签名   (3)
			//}
			if(LENmax_TxSPACE<2)
			{
				GET_Request_Frame(PORTn);//分帧标志
				return 0;
			}
			p8tx[0]=DataType_enum;
			p8tx[1]=3;
			return 2;
		default:
			UARTCtrl->DAR=6;//数据访问结果
			return 0;
	}
}


void TEST_ConnectAppOI_LIST(void)//测试对象列表
{
	u32 i;
	u32 x;
	u32 Len;
	u8* p8;
	u32 NUMmax;

	NUMmax=NUM_LIST_max;
	p8=(u8*)&ConnectAppOI_LIST;
	Len=0;
	for(i=0;i<NUMmax;i++)
	{
		x=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据)
		p8+=x;
		Len+=x;
	}
	x=sizeof(ConnectAppOI_LIST);
	if(Len!=x)
	{
		Comm_Ram->DisplayAllErrorTimer=10;//上电全显或系统错误显示秒定时器
		DisplayStringAutoUp(0,9,(u8*)"\x0""可应用对象列表错");//显示字符串自动向上平移;出口:修改下一显示行并寄存在ADDR_AutoRowCol
	}
}





